### Pandas
You can think of pandas as a powerful version of Excel, with more features.
What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [105]:
import numpy as np
import pandas as pd

### Creating a Series
You can convert a list,numpy array, or dictionary to a Series:

In [106]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [107]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [108]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [109]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [110]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [111]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [112]:
pd.Series(d)  # series from a dictionary

a    10
b    20
c    30
dtype: int64

### Data in a Series
A pandas Series can hold a variety of object types:

In [113]:
pd.Series(data=labels) # String type

0    a
1    b
2    c
dtype: object

In [114]:
# Even functions (although unlikely that you will use this)
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an Index
The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

In [115]:
ser1 = pd.Series([1, 2, 3, 4], index = ['USA', 'Germany','USSR', 'Japan'])

ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [116]:
ser2 = pd.Series([1,2,5,4], index=['USA', 'Germany','Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [117]:
print(ser1['USA'])

# Operations are then also done based off of index:
ser1 + ser2

1

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### DataFrames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [118]:
from numpy.random import randn
np.random.seed(101)

In [119]:
# randn(5, 4) : 5 rows and 4 columns
df = pd.DataFrame(randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Selection and Indexing
Let's learn the various methods to grab data from a DataFrame

In [120]:
df['W']  # returns back a series (here column)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [121]:
# Pass a list of column names
# returns back another dataframe
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [122]:
df.W    # SQL Syntax (NOT RECOMMENDED!)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [123]:
# DataFrame Columns are just Series
type(df['W'])

pandas.core.series.Series

In [124]:
# adding a new column
df['new'] = df['W'] + df['Y']

df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [125]:
# removing a column
df.drop('new', axis=1)  # axis=1 refers to columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [126]:
df  # Not inplace unless specified!

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [127]:
df.drop('new', axis=1, inplace=True)

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [128]:
# Can also drop rows this way
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [129]:
# selecting rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [130]:
# select based off of position instead of label
df.iloc[2]  # row C

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [131]:
# Selecting subset of rows and columns
df.loc['B', 'Y'] # [row, col]

-0.8480769834036315

In [132]:
df.loc[['A', 'B'], ['W', 'Y']]  # returns back a dataframe

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection
An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [133]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [134]:
df[df > 0]  # true => show value | false => NaN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [135]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [136]:
df[df['W'] > 0]  # shows only rows that have > 0 in the column 'W'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [137]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [138]:
df[df['W'] > 0][['Y', 'X']]  # changed the order of Y and X

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [139]:
# For two conditions you can use '|' and '&' with parenthesis:
df[(df['W'] > 0) & (df['Y'] > 0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

#### More Indexing Details
resetting the index or setting it something else

In [140]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [141]:
# Reset to default 0,1,...,n index
# this will add previous index as a new column
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [142]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind  # add a new column to the dataframe
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [143]:
df.set_index('States', inplace=True)
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-Index and Index Hierarchy

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [148]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])

df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [149]:
df['A']

G1  1   -1.005187
    2    0.187125
    3   -1.382920
G2  1    0.961458
    2    0.992573
    3   -1.046780
Name: A, dtype: float64

In [150]:
df.loc['G1']

          A         B
1 -1.005187 -0.741790
2  0.187125 -0.732845
3 -1.382920  1.482495

In [151]:
df.loc['G1'].loc[1]

A   -1.005187
B   -0.741790
Name: 1, dtype: float64

In [153]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [154]:
df.index.names

FrozenList([None, None])

In [156]:
df.index.names = ['Group', 'Number'] # setting names for different levels of indexes

df

                     A         B
Group Number
G1    1      -1.005187 -0.741790
      2       0.187125 -0.732845
      3      -1.382920  1.482495
G2    1       0.961458 -2.141212
      2       0.992573  1.192241
      3      -1.046780  1.292765

### Missing Data
a few methods to deal with Missing Data in pandas:

In [157]:
df = pd.DataFrame({'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [158]:
# removes all rows that include any sort of NaN cell
df.dropna()

     A    B  C
0  1.0  5.0  1

In [159]:
# drop all columns that include NaN
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
# only remove rows that have atleast 2 NaN cells in them
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [161]:
df.fillna(value='Filled Value')

              A             B  C
0           1.0           5.0  1
1           2.0  Filled Value  2
2  Filled Value  Filled Value  3

In [162]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby
The groupby method allows you to group rows of data together and call aggregate functions

In [165]:
# Create dataframe out of a dictionary
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales':[200, 120, 340, 124, 243, 350]}

df = pd.DataFrame(data)

df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Now we you can use the .groupby() method to group rows together based off of a column name. 
For instance let's group based of Company. This will create a **DataFrameGroupBy** object:

In [170]:
df.groupby('Company')

In [171]:
# You can save this object as a new variable:
by_comp = df.groupby('Company')

In [173]:
by_comp['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [175]:
by_comp['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [178]:
by_comp['Sales'].min()

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [179]:
by_comp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [ ]:
# how many unqiue cells based on each group
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [181]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [182]:
by_comp.describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

### Merging, Joining, and Concatenating
There are 3 main ways of combining DataFrames together: **Merging**, **Joining** and **Concatenating**.

In [196]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

#### Concatenation
Concatenation basically glues together DataFrames. Keep in mind that **dimensions should match along the axis you are concatenating on**. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [197]:
# will concat them based on rows, stacks the dataframes on top of each other
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
# based on columns, stacks them besides each other
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. Merging needs to happen on specific column name that has same value for both Dataframes.

For example:

In [224]:
left = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [225]:
# here we get keys from second DataFrame
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [226]:
# a more complicated example:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})

In [227]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [228]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [229]:
# only shows rows that in them both dataframes have same key1, key2
# we have two lines two K1,K0 since one'k1,k0' on left dataframe matches two on right dataframe
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [230]:
# outter merge, includes NaN value for rows that have no value for that specific key
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [231]:
# left merge, all rows from left df are kept, only common rows from right df are kept
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [232]:
# right merge, all rows from right df are kept, only common rows from left df are kept
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [221]:
l = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                  'B': ['B0', 'B1', 'B2']},
                  index=['K0', 'K1', 'K2'])

r = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                  'D': ['D0', 'D2', 'D3']},
                  index=['K0', 'K2', 'K3'])

In [236]:
print(l)
print('\n')
print(r)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2


     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
l.join(r)  # here we join them based on similar index values

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [238]:
r.join(l)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [237]:
l.join(r, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations
There are lots of operations with pandas that will be really useful, but don't fall into any distinct category.

In [239]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
# Info on Unique Values
# gives back array of unique elements in col2 column
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [ ]:
df['col2'].nunique()  # count of unique elements

3

In [ ]:
# see each element in the coulmn has been repeated how many times
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [ ]:
# Selecting Data
# Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1'] > 2) & (df['col3']=='xyz')]

newdf

   col1  col2 col3
3     4   444  xyz

In [245]:
# Applying Functions
def times2(x):
    return x * 2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df[['col1', 'col2']].sum()  # sum of all elements in each column

col1      10
col2    2109
dtype: int64

In [249]:
df['col3'].sum()

'abcdefghixyz'

In [250]:
# Permanently Removing a Column
del df['col1']

df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [251]:
# Get column and index names:
df.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
df.index  # value for row names

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# Sorting and Ordering a DataFrame:
df.sort_values(by='col2')  #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [254]:
# Find Null Values or Check for Null Values
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

### PIVOT TABLE

In [257]:
data = {'A': ['foo','foo','foo','bar','bar','bar'],
        'B': ['one','one','two','two','one','one'],
        'C': ['x','y','x','y','x','y'],
        'D': [1, 3, 2, 5, 4, 1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [259]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])
# in this pivot table we find out that, i.e : what is the value in column D when the column A is bar
# column B is two and column C is x or y. bar,one,x = 4

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Date and time in Pandas

In [262]:
from datetime import datetime

my_year = 2017
my_month = 1
my_day = 2
my_hour = 13
my_minute = 30
my_second = 15

# January 2nd, 2017
my_date = datetime(my_year, my_month, my_day)

print(my_date)
print(my_date.day)

2017-01-02 00:00:00
2

In [ ]:
'''
NumPy Datetime Arrays

NumPy handles dates more efficiently than Python's datetime format.
The NumPy data type is called "datetime64" to distinguish it from Python's datetime
'''

np.array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64')
np.array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[h]')  # by hour
np.array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[Y]')  # by year

array(['2016', '2017', '2018'], dtype='datetime64[Y]')

In [267]:
'''
NumPy Date Ranges
Just as np.arange(start, stop, step) can be used to produce an array of evenly-spaced integers, we can pass a dtype argument to obtain an array of dates. Remember that the stop date is exclusive.
'''
# AN ARRAY OF DATES FROM 6/1/18 TO 6/22/18 SPACED ONE WEEK APART
np.arange('2018-06-01', '2018-06-23', 7, dtype='datetime64[D]')

array(['2018-06-01', '2018-06-08', '2018-06-15', '2018-06-22'],
      dtype='datetime64[D]')

In [268]:
# By omitting the step value we can obtain every value based on the precision.
# AN ARRAY OF DATES FOR EVERY YEAR FROM 1968 TO 1975
np.arange('1968', '1976', dtype='datetime64[Y]')

array(['1968', '1969', '1970', '1971', '1972', '1973', '1974', '1975'],
      dtype='datetime64[Y]')

In [269]:
'''
Pandas Datetime Index
We'll usually deal with time series as a datetime index when working with pandas dataframes. Fortunately pandas has a lot of functions and methods to work with time series
The simplest way to build a DatetimeIndex is with the pd.date_range() method:
'''

# THE WEEK OF JULY 8TH, 2018
pd.date_range('7/8/2018', periods=7, freq='D')

DatetimeIndex(['2018-07-08', '2018-07-09', '2018-07-10', '2018-07-11',
               '2018-07-12', '2018-07-13', '2018-07-14'],
              dtype='datetime64[ns]', freq='D')

In [270]:
# Create a NumPy datetime array
some_dates = np.array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[D]')

some_dates

array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[D]')

In [271]:
# Convert to an index
idx = pd.DatetimeIndex(some_dates)

idx

DatetimeIndex(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[s]', freq=None)

In [272]:
# Create some random data
data = np.random.randn(3, 2)
cols = ['A', 'B']

data

array([[-1.46751402, -0.49409536],
       [-0.16253473,  0.48580874],
       [ 0.39248881,  0.22149069]])

In [ ]:
# Create a DataFrame with our random data, our date index, and our columns
df = pd.DataFrame(data, index=idx, columns=cols)

df

                   A         B
2016-03-15 -1.467514 -0.494095
2017-05-24 -0.162535  0.485809
2018-08-09  0.392489  0.221491

In [277]:
print(df.index)
print(df.index.max())

# Latest Date Index Location, we have 3 rows, 0,1,2
print(df.index.argmax())

DatetimeIndex(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[s]', freq=None)
2018-08-09 00:00:00
2

In [ ]:
# Earliest Date Value
print(df.index.min())
# earliest date location
print(df.index.argmin())

2016-03-15 00:00:00
0

In [ ]:
# basic example of dataset cleaning
df = pd.read_excel('AFI_market_all4.xlsx')

# Accesses the column named "%Key" in the DataFrame
# applies a lambda function to each value (x) in the "%Key" column
# The lambda function takes the last 7 characters from each string using slicing x[-7:]
# ID2023-06 => 023-06
df['Date'] = df["%Key"].apply(lambda x: x[-7:])

# get characters from 0 to 3
df['SCC'] = df["%Key"].apply(lambda x: x[:4])

In [ ]:
date_format = '%Y0%m'

df["Date_excel"] = df["Date"].apply(lambda x: datetime.strptime(x, date_format))

# This applies a function to each pair of values from the two columns NetDueDate_PIA and ClearDate_PIA
# If ClearDate_PIA (y) is not "-", it calculates the difference in days between NetDueDate_PIA (x) and ClearDate_PIA (y)
# If y is "-" (which seems to mean it hasnt been cleared yet), it returns "Not cleared"
# [*map(...)] => This expands the map object into a list
df["Duration"] = [
    *map(
        lambda x, y: (x - y).days if y != "-" else "Not cleared",
        df["NetDueDate_PIA"],
        df["ClearDate_PIA"]
    )
]

In [ ]:
# df["Duration"].apply(...): Applies a function to each value in the "Duration" column
# "Yes": If the duration is a number (either int or float) and it's less than 0, it's considered overdue
# "-": If the value is "Not cleared" (i.e., no clear date yet), mark it with a dash
# "No": Anything else (including 0 or positive duration) is not overdue
df["Overdue_Y_N"] = df["Duration"].apply(
    lambda x: 
        "Yes" if (isinstance(x, (int, float)) and x < 0) 
        else ("-" if x == "Not cleared" 
        else "No")
)

### Data Input and Output
This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods.

# read csv into a dataframe
df = pd.read_csv('example')

# export dataframe as a csv file
df.to_csv('df')

In [ ]:
# Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects. (needs 'conda install BeautifulSoup4' to work)
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df

In [ ]:
####################################### Reading CSV File #######################################

from pandas import json_normalize
from pandas.errors import ParserError
from sqlalchemy import create_engine
import pandas as pd
import requests

In [ ]:

# Create list of columns to use
cols = ["zipcode", "agi_stub", "mars1", "MARS2", "NUMDEP"]
# Create data frame from csv using only selected columns
data = pd.read_csv("vt_tax_data_2016.csv", usecols=cols)

# View counts of dependents and tax returns by income level
print(data.groupby("agi_stub").sum())

In [ ]:
# how to skip first 10 rows and read second 10 rows of a dataframe
df_x = pd.read_csv("df.csv", nrows=10, skiprows=10, header=None)
# read data-type of all columns
print(df_x.dtypes)

In [ ]:
# how to give special dataType to columns when loading the dataframe
data_types = {'agi_stub': int, "zipcode": str}

# Load csv using dtype to set correct data types
data = pd.read_csv("data_2016.csv", dtype=data_types)

In [ ]:
# how to import csv files with corroupt rows
try:
    # do not throw error when reading corrupted lines, just send a warning
    data = pd.read_csv("vt_tax_data_2016_corrupt.csv", on_bad_lines='warn')
    # View first 5 records
    print(data.head())
except ParserError:
    print("Your data contained rows that could not be parsed.")

In [ ]:
# how to give pandas "custom values" to be considered Null when importing data
null_values = {"zipcode": 0, "cat": "none"}
data = pd.read_csv("data_2017.csv", na_values=null_values)

In [ ]:
####################################### Reading Excel File #######################################

# read column AD and columns AW to BA
col_string = "AD, AW:BA"
response_df = pd.read_excel("survey_headers.xlsx", skiprows=2, usecols=col_string)
# show all cols
print(response_df.columns)

# create a dataframe based on the second sheet of excel file:
# 0, 1, 2,...
response_df = pd.read_excel("survey_headers.xlsx", sheet_name=1)

# Create df from second worksheet by referencing its name
response_df = pd.read_excel("fcc_survey.xlsx", sheet_name="2018")

# Graph where people would like to get a developer job
job_prefs = response_df.groupby("JobPref").JobPref.count()

# Load both the 2016 and 2017 sheets by name
all_survey_data = pd.read_excel("fcc_survey.xlsx", sheet_name=['2016', '2017'])

# Load all sheets in the Excel file
all_survey_data = pd.read_excel("fcc_survey.xlsx", sheet_name=None)

In [ ]:
# Set up for loop to iterate through sheets from loaded data

# Create an empty data frame
all_responses = pd.DataFrame()

for df in all_survey_data.values():
    # Print the number of rows being added
    print("Adding {} rows".format(df.shape[0]))
    # add df to all_responses, assign result
    all_responses = pd.concat([all_responses, df], ignore_index=True)

In [ ]:
# Load the data
survey_data = pd.read_excel("fcc_survey_subset.xlsx")
# Count NA values in each column
print(survey_data.isna().sum())

# pandas loads True/False columns as float by default, NA and missing values in such column end up being considered True

In [ ]:
# Set dtype to load appropriate column(s) as Boolean data
survey_datab = pd.read_excel("fcc_survey_subset.xlsx", dtype={"HasDebt": bool})
# View financial burdens by Boolean group
print(survey_data.groupby("HasDebt").sum())

# what to do when data has "Yes/No" values
df = pd.read_excel("data.xlsx", dtype={"hasDebt": bool, "attendsClassYesNo": bool}, true_values=["Yes"], false_values=["No"])

In [ ]:
# Parsing date and time from excel datasheets

# here the data has standard datetime format, so no need for extra editing => 2016-03-29 21:23:13
# Part1StartTime : the column with datetime
df_with_time = pd.read_excel("data.xlsx", parse_dates=["Part1StartTime"])

# get datetime from multiple columns
df_with_time = pd.read_excel("data.xlsx")
# Combine date and time columns manually as strings, then format it as datetime column
df["Part2Start"] = pd.to_datetime(df["Part2StartDate"].astype(str) + " " + df["Part2StartTime"].astype(str))

# parsing non-standard date formats
# 03302016 08:50:42  => "%m%d%Y %H:%M:%S"
df["f_datetime"] = pd.to_datetime(df["unf_datetime"], format="%m%d%Y %H:%M:%S")

In [ ]:
####################################### Reading from database with Pandas #######################################

# Load pandas and sqlalchemy's create_engine

# Create database engine to manage connections
engine = create_engine("sqlite:///data.db")

# Load entire weather table by table name
weather = pd.read_sql("weather", engine)

# Load entire weather table with SQL
weather = pd.read_sql("SELECT * from weather", engine)
print(weather.head)

# Write query to get records from Brooklyn
query = "SELECT * FROM hpd311calls WHERE borough = 'BROOKLYN';"
# Query the database
brooklyn_calls = pd.read_sql(query, engine)
print(brooklyn_calls.borough.unique())

# Write query to get plumbing call counts by borough
query = "SELECT borough, COUNT(*) FROM hpd311calls WHERE complaint_type = 'PLUMBING' GROUP BY borough;"
# Query databse and create dataframe
plumbing_call_counts_df = pd.read_sql(query, engine)

# how many heat/hot water call counts by specific date
query = "SELECT hpd311calls.created_date, COUNT(*) FROM hpd311calls WHERE hpd311calls.complaint_type = 'HEAT/HOT WATER' GROUP BY hpd311calls.created_date;"
# Query database and save results as df
df = pd.read_sql(query, engine)
# View first 5 records
print(df.head())

In [ ]:
####################################### Reading from JSON, API with Pandas #######################################

# Load pandas as pd
# Load the daily report to a data frame
pop_in_shelters = pd.read_json("dhs_daily_report.json")
# View summary stats about DF
print(pop_in_shelters.describe())


JSON isn't a tabular format, so pandas makes assumptions about its orientation when loading data. Most JSON data you encounter will be in orientations that pandas 
can automatically transform into a data frame.
Sometimes, data is oriented differently. To reduce the file size, it has been split formatted. The try/except block will alert you if there are errors loading the data.

In [ ]:
try:
    # Load the JSON with orient specified
    df = pd.read_json("dhs_report_reformatted.json", orient="split")
    df["date_of_census"] = pd.to_datetime(df["date_of_census"])
except ValueError:
    print("pandas could not parse the JSON.")

'''
This tells pandas how the JSON file is structured. When orient="split", pandas expects the JSON to be in the following format:
{
  "columns": ["col1", "col2", "col3"],
  "index": [0, 1, 2],
  "data": [
    [val1, val2, val3],
    [val4, val5, val6],
    ...
  ]
}

This format is optimized for performance and compactness when working between Python and pandas

orient="split" just tells pandas what structure to expect inside the JSON file. If the structure doesn't match what split expects, you'll get a ValueError
'''

In [ ]:
api_url = "https://api.yelp.com/v3/businesses/search"
api_key = "*****"
# define parameters
parameters = {"term": "cafe", "location": "NYC"}
# Create dictionary that passes Authorization and key string
headers = {"Authorization": f"Bearer {api_key}"}
# Get data about NYC cafes from the Yelp API
response = requests.get(api_url, headers=headers, params=parameters)
# Extract JSON data from the response
data = response.json()

# Load data to a data frame, create dataframe from list of businesses from JSON response
cafes = pd.DataFrame(data["businesses"])
# View the data's dtypes
print(cafes.dtypes)

In [ ]:
import pandas as pd

data = [
    {"id": 1, "info": {"name": "Alice", "age": 25}},
    {"id": 2, "info": {"name": "Bob", "age": 30}},
]

df = pd.json_normalize(data, record_prefix=None)
print(df)

In [ ]:
# working with nested json files
# Load json_normalize()
# Isolate the JSON data from the API response
data = response.json()
# Flatten business data into a data frame, replace separator to '-' , here we have one-level nested data
cafes = json_normalize(data["businesses"], sep="-")
print(cafes.head())

# Flatten businesses records and set underscore separators
flat_cafes = pd.json_normalize(data["businesses"], sep="_")

# Specify record path to get categories data, two-level nested
# data["businesses"][0]["categories"]
flat_cafes = json_normalize(data["businesses"], sep="_", record_path="categories")

flat_cafes = json_normalize(data["businesses"], 
                            sep="_", 
                            record_path="categories",
                            meta=["name", "alias", "rating", ["coordinates", "latitude"], ["coordinates", "longitude"]]
                            )

In [ ]:
data = {
    "businesses": [
        {
            "name": "Cafe Blue",
            "alias": "cafe-blue",
            "rating": 4.5,
            "coordinates": {
                "latitude": 40.7128,
                "longitude": -74.0060
            },
            "categories": [
                {"alias": "coffee", "title": "Coffee & Tea"},
                {"alias": "cafes", "title": "Cafes"}
            ]
        },
        {
            "name": "Sunset Brew",
            "alias": "sunset-brew",
            "rating": 4.2,
            "coordinates": {
                "latitude": 34.0522,
                "longitude": -118.2437
            },
            "categories": [
                {"alias": "tea", "title": "Tea Rooms"},
                {"alias": "desserts", "title": "Desserts"}
            ]
        }
    ]
}

In [ ]:
# add new data to dataframe, Add an offset parameter to get cafes 51-100
parameters ={
    "term": "cafe",
    "location": "NYC",
    "sort_by": "rating",
    "limit": 50,
    "offset": 50
}

result = requests.get(api_url, headers=headers, params=parameters)
next_50_cafes = json_normalize(result.json()["businesses"])

# Append the results, setting ignore_index to renumber rows
cafes = pd.concat([cafes, next_50_cafes], ignore_index=True)